###################################################################

# Created by write_sdc on Sat Oct 22 15:45:24 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_fanout 20 [current_design]
set_max_transition 0.5 [current_design]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports clk]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports csb]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports web]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {addr[6]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {addr[5]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {addr[4]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {addr[3]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {addr[2]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {addr[1]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {addr[0]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[31]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[30]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[29]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[28]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[27]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[26]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[25]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[24]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[23]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[22]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[21]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[20]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[19]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[18]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[17]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[16]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[15]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[14]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[13]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[12]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[11]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[10]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[9]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[8]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[7]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[6]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[5]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[4]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[3]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[2]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[1]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {din[0]}]
set_load -pin_load 7 [get_ports {dout[31]}]
set_load -pin_load 7 [get_ports {dout[30]}]
set_load -pin_load 7 [get_ports {dout[29]}]
set_load -pin_load 7 [get_ports {dout[28]}]
set_load -pin_load 7 [get_ports {dout[27]}]
set_load -pin_load 7 [get_ports {dout[26]}]
set_load -pin_load 7 [get_ports {dout[25]}]
set_load -pin_load 7 [get_ports {dout[24]}]
set_load -pin_load 7 [get_ports {dout[23]}]
set_load -pin_load 7 [get_ports {dout[22]}]
set_load -pin_load 7 [get_ports {dout[21]}]
set_load -pin_load 7 [get_ports {dout[20]}]
set_load -pin_load 7 [get_ports {dout[19]}]
set_load -pin_load 7 [get_ports {dout[18]}]
set_load -pin_load 7 [get_ports {dout[17]}]
set_load -pin_load 7 [get_ports {dout[16]}]
set_load -pin_load 7 [get_ports {dout[15]}]
set_load -pin_load 7 [get_ports {dout[14]}]
set_load -pin_load 7 [get_ports {dout[13]}]
set_load -pin_load 7 [get_ports {dout[12]}]
set_load -pin_load 7 [get_ports {dout[11]}]
set_load -pin_load 7 [get_ports {dout[10]}]
set_load -pin_load 7 [get_ports {dout[9]}]
set_load -pin_load 7 [get_ports {dout[8]}]
set_load -pin_load 7 [get_ports {dout[7]}]
set_load -pin_load 7 [get_ports {dout[6]}]
set_load -pin_load 7 [get_ports {dout[5]}]
set_load -pin_load 7 [get_ports {dout[4]}]
set_load -pin_load 7 [get_ports {dout[3]}]
set_load -pin_load 7 [get_ports {dout[2]}]
set_load -pin_load 7 [get_ports {dout[1]}]
set_load -pin_load 7 [get_ports {dout[0]}]
create_clock [get_ports clk]  -name ideal_clock  -period 2  -waveform {0 1}
group_path -name FEEDTHROUGH  -from [list [get_ports csb] [get_ports web] [get_ports {addr[6]}] [get_ports {addr[5]}] [get_ports {addr[4]}] [get_ports {addr[3]}] [get_ports {addr[2]}] [get_ports {addr[1]}] [get_ports {addr[0]}] [get_ports {din[31]}] [get_ports {din[30]}] [get_ports {din[29]}] [get_ports {din[28]}] [get_ports {din[27]}] [get_ports {din[26]}] [get_ports {din[25]}] [get_ports {din[24]}] [get_ports {din[23]}] [get_ports {din[22]}] [get_ports {din[21]}] [get_ports {din[20]}] [get_ports {din[19]}] [get_ports {din[18]}] [get_ports {din[17]}] [get_ports {din[16]}] [get_ports {din[15]}] [get_ports {din[14]}] [get_ports {din[13]}] [get_ports {din[12]}] [get_ports {din[11]}] [get_ports {din[10]}] [get_ports {din[9]}] [get_ports {din[8]}] [get_ports {din[7]}] [get_ports {din[6]}] [get_ports {din[5]}] [get_ports {din[4]}] [get_ports {din[3]}] [get_ports {din[2]}] [get_ports {din[1]}] [get_ports {din[0]}]]  -to [list [get_ports {dout[31]}] [get_ports {dout[30]}] [get_ports {dout[29]}] [get_ports {dout[28]}] [get_ports {dout[27]}] [get_ports {dout[26]}] [get_ports {dout[25]}] [get_ports {dout[24]}] [get_ports {dout[23]}] [get_ports {dout[22]}] [get_ports {dout[21]}] [get_ports {dout[20]}] [get_ports {dout[19]}] [get_ports {dout[18]}] [get_ports {dout[17]}] [get_ports {dout[16]}] [get_ports {dout[15]}] [get_ports {dout[14]}] [get_ports {dout[13]}] [get_ports {dout[12]}] [get_ports {dout[11]}] [get_ports {dout[10]}] [get_ports {dout[9]}] [get_ports {dout[8]}] [get_ports {dout[7]}] [get_ports {dout[6]}] [get_ports {dout[5]}] [get_ports {dout[4]}] [get_ports {dout[3]}] [get_ports {dout[2]}] [get_ports {dout[1]}] [get_ports {dout[0]}]]
group_path -name REGIN  -from [list [get_ports csb] [get_ports web] [get_ports {addr[6]}] [get_ports {addr[5]}] [get_ports {addr[4]}] [get_ports {addr[3]}] [get_ports {addr[2]}] [get_ports {addr[1]}] [get_ports {addr[0]}] [get_ports {din[31]}] [get_ports {din[30]}] [get_ports {din[29]}] [get_ports {din[28]}] [get_ports {din[27]}] [get_ports {din[26]}] [get_ports {din[25]}] [get_ports {din[24]}] [get_ports {din[23]}] [get_ports {din[22]}] [get_ports {din[21]}] [get_ports {din[20]}] [get_ports {din[19]}] [get_ports {din[18]}] [get_ports {din[17]}] [get_ports {din[16]}] [get_ports {din[15]}] [get_ports {din[14]}] [get_ports {din[13]}] [get_ports {din[12]}] [get_ports {din[11]}] [get_ports {din[10]}] [get_ports {din[9]}] [get_ports {din[8]}] [get_ports {din[7]}] [get_ports {din[6]}] [get_ports {din[5]}] [get_ports {din[4]}] [get_ports {din[3]}] [get_ports {din[2]}] [get_ports {din[1]}] [get_ports {din[0]}]]
group_path -name REGOUT  -to [list [get_ports {dout[31]}] [get_ports {dout[30]}] [get_ports {dout[29]}] [get_ports {dout[28]}] [get_ports {dout[27]}] [get_ports {dout[26]}] [get_ports {dout[25]}] [get_ports {dout[24]}] [get_ports {dout[23]}] [get_ports {dout[22]}] [get_ports {dout[21]}] [get_ports {dout[20]}] [get_ports {dout[19]}] [get_ports {dout[18]}] [get_ports {dout[17]}] [get_ports {dout[16]}] [get_ports {dout[15]}] [get_ports {dout[14]}] [get_ports {dout[13]}] [get_ports {dout[12]}] [get_ports {dout[11]}] [get_ports {dout[10]}] [get_ports {dout[9]}] [get_ports {dout[8]}] [get_ports {dout[7]}] [get_ports {dout[6]}] [get_ports {dout[5]}] [get_ports {dout[4]}] [get_ports {dout[3]}] [get_ports {dout[2]}] [get_ports {dout[1]}] [get_ports {dout[0]}]]
set_input_delay -clock ideal_clock  1  [get_ports clk]
set_input_delay -clock ideal_clock  1  [get_ports csb]
set_input_delay -clock ideal_clock  1  [get_ports web]
set_input_delay -clock ideal_clock  1  [get_ports {addr[6]}]
set_input_delay -clock ideal_clock  1  [get_ports {addr[5]}]
set_input_delay -clock ideal_clock  1  [get_ports {addr[4]}]
set_input_delay -clock ideal_clock  1  [get_ports {addr[3]}]
set_input_delay -clock ideal_clock  1  [get_ports {addr[2]}]
set_input_delay -clock ideal_clock  1  [get_ports {addr[1]}]
set_input_delay -clock ideal_clock  1  [get_ports {addr[0]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[31]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[30]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[29]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[28]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[27]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[26]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[25]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[24]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[23]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[22]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[21]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[20]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[19]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[18]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[17]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[16]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[15]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[14]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[13]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[12]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[11]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[10]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[9]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[8]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[7]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[6]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[5]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[4]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[3]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[2]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[1]}]
set_input_delay -clock ideal_clock  1  [get_ports {din[0]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[31]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[30]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[29]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[28]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[27]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[26]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[25]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[24]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[23]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[22]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[21]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[20]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[19]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[18]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[17]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[16]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[15]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[14]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[13]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[12]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[11]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[10]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[9]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[8]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[7]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[6]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[5]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[4]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[3]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[2]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[1]}]
set_output_delay -clock ideal_clock  0  [get_ports {dout[0]}]
