###################################################################

# Created by write_sdc on Fri Oct 21 23:07:08 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_fanout 20 [current_design]
set_max_transition 0.5 [current_design]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {clk[0]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[31]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[30]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[29]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[28]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[27]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[26]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[25]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[24]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[23]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[22]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[21]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[20]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[19]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[18]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[17]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[16]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[15]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[14]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[13]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[12]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[11]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[10]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[9]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[8]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[7]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[6]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[5]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[4]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[3]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[2]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[1]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_msg[0]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {req_val[0]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {reset[0]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {resp_rdy[0]}]
set_load -pin_load 7 [get_ports {req_rdy[0]}]
set_load -pin_load 7 [get_ports {resp_msg[15]}]
set_load -pin_load 7 [get_ports {resp_msg[14]}]
set_load -pin_load 7 [get_ports {resp_msg[13]}]
set_load -pin_load 7 [get_ports {resp_msg[12]}]
set_load -pin_load 7 [get_ports {resp_msg[11]}]
set_load -pin_load 7 [get_ports {resp_msg[10]}]
set_load -pin_load 7 [get_ports {resp_msg[9]}]
set_load -pin_load 7 [get_ports {resp_msg[8]}]
set_load -pin_load 7 [get_ports {resp_msg[7]}]
set_load -pin_load 7 [get_ports {resp_msg[6]}]
set_load -pin_load 7 [get_ports {resp_msg[5]}]
set_load -pin_load 7 [get_ports {resp_msg[4]}]
set_load -pin_load 7 [get_ports {resp_msg[3]}]
set_load -pin_load 7 [get_ports {resp_msg[2]}]
set_load -pin_load 7 [get_ports {resp_msg[1]}]
set_load -pin_load 7 [get_ports {resp_msg[0]}]
set_load -pin_load 7 [get_ports {resp_val[0]}]
create_clock [get_ports {clk[0]}]  -name ideal_clock  -period 2  -waveform {0 1}
group_path -name FEEDTHROUGH  -from [list [get_ports {req_msg[31]}] [get_ports {req_msg[30]}] [get_ports {req_msg[29]}] [get_ports {req_msg[28]}] [get_ports {req_msg[27]}] [get_ports {req_msg[26]}] [get_ports {req_msg[25]}] [get_ports {req_msg[24]}] [get_ports {req_msg[23]}] [get_ports {req_msg[22]}] [get_ports {req_msg[21]}] [get_ports {req_msg[20]}] [get_ports {req_msg[19]}] [get_ports {req_msg[18]}] [get_ports {req_msg[17]}] [get_ports {req_msg[16]}] [get_ports {req_msg[15]}] [get_ports {req_msg[14]}] [get_ports {req_msg[13]}] [get_ports {req_msg[12]}] [get_ports {req_msg[11]}] [get_ports {req_msg[10]}] [get_ports {req_msg[9]}] [get_ports {req_msg[8]}] [get_ports {req_msg[7]}] [get_ports {req_msg[6]}] [get_ports {req_msg[5]}] [get_ports {req_msg[4]}] [get_ports {req_msg[3]}] [get_ports {req_msg[2]}] [get_ports {req_msg[1]}] [get_ports {req_msg[0]}] [get_ports {req_val[0]}] [get_ports {reset[0]}] [get_ports {resp_rdy[0]}]]  -to [list [get_ports {req_rdy[0]}] [get_ports {resp_msg[15]}] [get_ports {resp_msg[14]}] [get_ports {resp_msg[13]}] [get_ports {resp_msg[12]}] [get_ports {resp_msg[11]}] [get_ports {resp_msg[10]}] [get_ports {resp_msg[9]}] [get_ports {resp_msg[8]}] [get_ports {resp_msg[7]}] [get_ports {resp_msg[6]}] [get_ports {resp_msg[5]}] [get_ports {resp_msg[4]}] [get_ports {resp_msg[3]}] [get_ports {resp_msg[2]}] [get_ports {resp_msg[1]}] [get_ports {resp_msg[0]}] [get_ports {resp_val[0]}]]
group_path -name REGIN  -from [list [get_ports {req_msg[31]}] [get_ports {req_msg[30]}] [get_ports {req_msg[29]}] [get_ports {req_msg[28]}] [get_ports {req_msg[27]}] [get_ports {req_msg[26]}] [get_ports {req_msg[25]}] [get_ports {req_msg[24]}] [get_ports {req_msg[23]}] [get_ports {req_msg[22]}] [get_ports {req_msg[21]}] [get_ports {req_msg[20]}] [get_ports {req_msg[19]}] [get_ports {req_msg[18]}] [get_ports {req_msg[17]}] [get_ports {req_msg[16]}] [get_ports {req_msg[15]}] [get_ports {req_msg[14]}] [get_ports {req_msg[13]}] [get_ports {req_msg[12]}] [get_ports {req_msg[11]}] [get_ports {req_msg[10]}] [get_ports {req_msg[9]}] [get_ports {req_msg[8]}] [get_ports {req_msg[7]}] [get_ports {req_msg[6]}] [get_ports {req_msg[5]}] [get_ports {req_msg[4]}] [get_ports {req_msg[3]}] [get_ports {req_msg[2]}] [get_ports {req_msg[1]}] [get_ports {req_msg[0]}] [get_ports {req_val[0]}] [get_ports {reset[0]}] [get_ports {resp_rdy[0]}]]
group_path -name REGOUT  -to [list [get_ports {req_rdy[0]}] [get_ports {resp_msg[15]}] [get_ports {resp_msg[14]}] [get_ports {resp_msg[13]}] [get_ports {resp_msg[12]}] [get_ports {resp_msg[11]}] [get_ports {resp_msg[10]}] [get_ports {resp_msg[9]}] [get_ports {resp_msg[8]}] [get_ports {resp_msg[7]}] [get_ports {resp_msg[6]}] [get_ports {resp_msg[5]}] [get_ports {resp_msg[4]}] [get_ports {resp_msg[3]}] [get_ports {resp_msg[2]}] [get_ports {resp_msg[1]}] [get_ports {resp_msg[0]}] [get_ports {resp_val[0]}]]
set_input_delay -clock ideal_clock  1  [get_ports {clk[0]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[31]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[30]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[29]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[28]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[27]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[26]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[25]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[24]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[23]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[22]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[21]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[20]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[19]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[18]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[17]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[16]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[15]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[14]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[13]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[12]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[11]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[10]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[9]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[8]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[7]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[6]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[5]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[4]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[3]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[2]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[1]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_msg[0]}]
set_input_delay -clock ideal_clock  1  [get_ports {req_val[0]}]
set_input_delay -clock ideal_clock  1  [get_ports {reset[0]}]
set_input_delay -clock ideal_clock  1  [get_ports {resp_rdy[0]}]
set_output_delay -clock ideal_clock  0  [get_ports {req_rdy[0]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[15]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[14]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[13]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[12]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[11]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[10]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[9]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[8]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[7]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[6]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[5]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[4]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[3]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[2]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[1]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_msg[0]}]
set_output_delay -clock ideal_clock  0  [get_ports {resp_val[0]}]
